Revit 2026 API

# CategoryMaterial Property

---

Retrieves or changes the material of the category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Material Material { get; set; }
```
```vb
Public Property Material As Material
	Get
	Set
```
```cpp
public:
property Material^ Material {
	Material^ get ();
	void set (Material^ value);
}
```
```fsharp
member Material : Material with get, set
```

#### Property Value

Material if this category does not have a material.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: material cannot be set for annotation categories. |

#### Reference

Category Class

Autodesk.Revit.DB Namespace